from idvd import Students, Group, Groups
print("результати")
#використовуємо клас Students, за допомогою якого
#визначається кількість дівчат і кількість хлопців:
print("створюємо групи з дівчатами та хлопцями:")
a = Students(3, 5)
print(a)
b = Students(1, 1)
print(b)
#використовуємо клас Students, за допомогою якого
#перезавантажується оператор "-":
print("вилучаємо однакову кількість дівчат і хлопців:")
a.__sub__(1)
print(a-1)
#використовуємо клас Group, за допомогою якого
#повертається спеціальність і перезавантажується оператор ">":
print("створюємо групи за спеціальностями:")
A = Group(6,8,"МТС-21")
print(A)
B = Group(4, 7, 'МТП-41')
print(B)
print("порівнюємо де більше студентів:")
print(f'Більше студентів у групі: {max(A,B)}')
#використовуємо клас Groups, за допогою якого
#додається вручну група і з текстового файлу
#та відображається найбільша за кількістю студентів
#груп для кожної спеціальності
print("додаємо вручну групу:")
C = Groups()
C.addGroup(5, 3, "МТС-21")
print(C)
print("список всіх груп:")
D = Groups()
D.addGroup(4, 4, "МТФ-21")
D.download_from_file("list_of_groups.txt", 4, 4, "МТФ-21")
print("шукаємо найбільшу групу серед усіх спеціалізацій:")
D.biggest_groups_by_specialisation()
print(D)
